src/cf/src/Enums/Отрасли/Отрасли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отрасли</name>
  <enumValues>
    <name>Торговля</name>
  </enumValues>
  <enumValues>
    <name>Строительство</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>БланкПодвал</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкШапка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизацииДиаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФонПечатныхФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСклад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Евро</name>
      <description>EUR</description>
    </items>
    <items>
      <name>MoroccanDirham</name>
      <description>MAD</description>
    </items>
    <items>
      <name>РоссийскийРубль</name>
      <description>RUR</description>
    </items>
    <items>
      <name>ДолларСША</name>
      <description>USD</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПараметрыИсчисления</name>
    <attributes>
      <name>Локализация</name>
      <type>
        <types>EnumRef.Локализации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧасть1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧасть2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧасть5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧастьРод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧастьРод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/НачальноеЗаполнениеВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Начальное заполнение новой базы: организация, пользователи с физлицами и
// служебный администратор. Единая серверная логика двух точек входа:
//  - визард первого запуска ОбщаяФорма.ФормаПервогоЗапуска собирает параметры
//    с экрана и зовёт ЗаполнитьБазу();
//  - headless-запуск обработкой НачальноеЗаполнение по параметру
//    /C "НачальноеЗаполнение;<payload.json>;<result.json>" читает JSON и зовёт
//    ЗаполнитьБазуИзJSON(). Контракт файлов - docs/DEPLOY.md.
//
// Заполнение идемпотентно: организация ищется по наименованию, пользователи - по
// логину; найденное не пересоздаётся и не меняется (пароли существующих не трогаются).
// Пароли в результат и в отчёт не попадают.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Шаблон параметров заполнения для ЗаполнитьБазу().
//
// Возвращаемое значение:
//  Структура:
//   * Организация - Структура:
//      ** Наименование    - Строка - обязательное
//      ** ВидКонтрагента  - ПеречислениеСсылка.ВидыКонтрагентов
//      ** Префикс         - Строка - префикс номеров документов
//      ** Логотип         - Строка - адрес во временном хранилище или пустая строка
//      ** ФонПечатныхФорм - Строка - адрес во временном хранилище или пустая строка
//   * Пользователи - Массив из Структура - см. ОписаниеПользователя()
//   * СлужебныйАдминистратор - Структура, Неопределено - Логин, Пароль скрытого
//                              администратора; Неопределено - не создавать
//   * Валюта - Строка - код (MAD, EUR) или наименование валюты регламентированного
//              учёта; пустая строка - константу не трогать
//   * Страна - Строка - код альфа-2 страны производственного календаря; пустая - не трогать
//   * Язык   - Строка - имя или код языка по умолчанию для пользователей без языка
//   * Отрасль - ПеречислениеСсылка.Отрасли - отрасль организации; пустая - не применять
//
Функция ПараметрыЗаполнения() Экспорт

	Организация = Новый Структура;
	Организация.Вставить("Наименование", "");
	Организация.Вставить("ВидКонтрагента", Перечисления.ВидыКонтрагентов.ЮридическоеЛицо);
	Организация.Вставить("Префикс", "");
	Организация.Вставить("Логотип", "");
	Организация.Вставить("ФонПечатныхФорм", "");

	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Организация);
	Параметры.Вставить("Пользователи", Новый Массив);
	Параметры.Вставить("СлужебныйАдминистратор", Неопределено);
	Параметры.Вставить("Валюта", "");
	Параметры.Вставить("Страна", "");
	Параметры.Вставить("Язык", "");
	Параметры.Вставить("Отрасль", Перечисления.Отрасли.ПустаяСсылка());

	Возврат Параметры;

КонецФункции

// Применяет отрасль организации: ставит константу и заводит отраслевые дополнительные
// реквизиты (УправлениеСвойствами). Идемпотентно: существующие реквизиты не дублируются.
//
// Параметры:
//  Отрасль - ПеречислениеСсылка.Отрасли - пустая - ничего не делать
//
// Возвращаемое значение:
//  Число - сколько дополнительных реквизитов создано
//
Функция ПрименитьОтрасль(Отрасль) Экспорт

	Если Не ЗначениеЗаполнено(Отрасль) Тогда
		Возврат 0;
	КонецЕсли;

	Константы.Отрасль.Установить(Отрасль);

	Если Отрасль <> Перечисления.Отрасли.Строительство Тогда
		// Торговля и прочее: типовой состав реквизитов, ничего добавлять не нужно.
		Возврат 0;
	КонецЕсли;

	// Реквизиты объекта недвижимости у номенклатуры - состав из практики застройщика
	// (docs/drissotex-analysis/ahmed-2026-09-07.md), без изменения метаданных.
	Создано = 0;
	Для Каждого Описание Из ОтраслевыеРеквизитыСтроительства() Цикл
		Создано = Создано + ДобавитьОтраслевойРеквизит(Отрасль, Описание);
	КонецЦикла;

	Возврат Создано;

КонецФункции

// Шаблон описания одного пользователя для ПараметрыЗаполнения().Пользователи.
//
// Возвращаемое значение:
//  Структура:
//   * Логин     - Строка - имя пользователя ИБ, обязательное
//   * Пароль    - Строка - пароль, обязательное
//   * ПолноеИмя - Строка - ФИО; пустое - берётся логин
//   * Язык      - Строка - имя или код языка интерфейса; пустое - язык из параметров или основной
//   * Роли      - Массив из Строка - имена ролей; пустой массив - Администратор
//
Функция ОписаниеПользователя() Экспорт

	Пользователь = Новый Структура;
	Пользователь.Вставить("Логин", "");
	Пользователь.Вставить("Пароль", "");
	Пользователь.Вставить("ПолноеИмя", "");
	Пользователь.Вставить("Язык", "");
	Пользователь.Вставить("Роли", Новый Массив);
	Возврат Пользователь;

КонецФункции

// Имя скрытого служебного администратора tinycio-1c: под ним в базу входит поддержка.
//
// Возвращаемое значение:
//  Строка - имя пользователя ИБ
//
Функция ИмяСлужебногоАдминистратора() Экспорт

	Возврат "tinycio-1c";

КонецФункции

// Случайный пароль из букв и цифр без похожих символов (0/O, 1/l/I).
//
// Параметры:
//  Длина - Число - длина пароля
//
// Возвращаемое значение:
//  Строка - пароль
//
Функция СлучайныйПароль(Длина = 16) Экспорт

	Алфавит = "abcdefghijkmnpqrstuvwxyzABCDEFGHJKLMNPQRSTUVWXYZ23456789";
	Генератор = Новый ГенераторСлучайныхЧисел;
	Пароль = "";
	Пока СтрДлина(Пароль) < Длина Цикл
		Пароль = Пароль + Сред(Алфавит, Генератор.СлучайноеЧисло(1, СтрДлина(Алфавит)), 1);
	КонецЦикла;
	Возврат Пароль;

КонецФункции

// Заполняет базу по структуре параметров. Ошибка данных - исключение.
//
// Параметры:
//  Параметры - Структура - см. ПараметрыЗаполнения()
//
// Возвращаемое значение:
//  Структура:
//   * Организация              - СправочникСсылка.Организации
//   * ОрганизацияСоздана       - Булево - Ложь, если организация с таким наименованием уже была
//   * Пользователи             - Массив из Структура - Логин, Создан (Булево)
//   * СлужебныйАдминистраторСоздан - Булево
//   * ВсегоОрганизаций         - Число - организаций в базе после заполнения
//   * ВсегоПользователей       - Число - пользователей ИБ после заполнения
//   * Предупреждения           - Массив из Строка - что заменено умолчанием (роль, язык, валюта)
//   * СозданоРеквизитовОтрасли - Число - дополнительных реквизитов заведено по отрасли
//
Функция ЗаполнитьБазу(Параметры) Экспорт

	ПроверитьПараметры(Параметры);

	Результат = Новый Структура;
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("ОрганизацияСоздана", Ложь);
	Результат.Вставить("Пользователи", Новый Массив);
	Результат.Вставить("СлужебныйАдминистраторСоздан", Ложь);
	Результат.Вставить("ВсегоОрганизаций", 0);
	Результат.Вставить("ВсегоПользователей", 0);
	Результат.Вставить("Предупреждения", Новый Массив);

	Результат.Организация = НайтиОрганизацию(Параметры.Организация.Наименование);
	Если Не ЗначениеЗаполнено(Результат.Организация) Тогда
		Результат.Организация = СоздатьОрганизацию(Параметры.Организация);
		Результат.ОрганизацияСоздана = Истина;
	КонецЕсли;

	УстановитьВалютуИСтрану(Параметры, Результат.Предупреждения);

	ЯзыкПоУмолчанию = ЯзыкПоИмениИлиКоду(Параметры.Язык, Результат.Предупреждения, "");

	Для Каждого Пользователь Из Параметры.Пользователи Цикл
		ЯзыкПользователя = ЯзыкПоИмениИлиКоду(Пользователь.Язык, Результат.Предупреждения, Пользователь.Логин);
		Если ЯзыкПользователя = Неопределено Тогда
			ЯзыкПользователя = ЯзыкПоУмолчанию;
		КонецЕсли;
		Создан = ЗаписатьПользователя(Пользователь, Результат.Организация, ЯзыкПользователя, Истина, Результат.Предупреждения);
		Результат.Пользователи.Добавить(Новый Структура("Логин, Создан", СокрЛП(Пользователь.Логин), Создан));
	КонецЦикла;

	Если Параметры.СлужебныйАдминистратор <> Неопределено Тогда
		Администратор = ОписаниеПользователя();
		ЗаполнитьЗначенияСвойств(Администратор, Параметры.СлужебныйАдминистратор);
		Если ПустаяСтрока(Администратор.Логин) Тогда
			Администратор.Логин = ИмяСлужебногоАдминистратора();
		КонецЕсли;
		Администратор.ПолноеИмя = Администратор.Логин;
		Администратор.Роли.Очистить();
		Администратор.Роли.Добавить("Администратор");
		Результат.СлужебныйАдминистраторСоздан = ЗаписатьПользователя(Администратор, Результат.Организация,
			Неопределено, Ложь, Результат.Предупреждения);
	КонецЕсли;

	Результат.Вставить("СозданоРеквизитовОтрасли", ПрименитьОтрасль(Параметры.Отрасль));

	Результат.ВсегоОрганизаций = КоличествоОрганизаций();
	Результат.ВсегоПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей().Количество();

	Возврат Результат;

КонецФункции

// Заполняет базу по JSON-описанию (payload задания initial_fill хаба tinycio,
// формат - docs/DEPLOY.md). Исключений не бросает: ошибка возвращается в структуре,
// чтобы клиент-запускатель записал её в отчёт и завершил работу штатно.
//
// Параметры:
//  ТекстJSON - Строка - содержимое payload-файла
//
// Возвращаемое значение:
//  Структура:
//   * Успех         - Булево
//   * Ошибка        - Строка - описание ошибки; пустая при успехе
//   * РезультатJSON - Строка - result-файл для вызывающего скрипта, без паролей
//   * Сводка        - Строка - одна строка для маркера ИТОГ отчёта
//
Функция ЗаполнитьБазуИзJSON(ТекстJSON) Экспорт

	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Ложь);
	Ответ.Вставить("Ошибка", "");
	Ответ.Вставить("РезультатJSON", "");
	Ответ.Вставить("Сводка", "");

	Попытка
		Параметры = ПараметрыИзJSON(ТекстJSON);
		Результат = ЗаполнитьБазу(Параметры);
	Исключение
		Информация = ИнформацияОбОшибке();
		// МенеджерОбработкиОшибок в 8.5.1 не существует (docs/TESTING.md) - глобальные методы.
		// BSLLS:DeprecatedMethodCall-off
		Ответ.Ошибка = КраткоеПредставлениеОшибки(Информация);
		Подробно = ПодробноеПредставлениеОшибки(Информация);
		// BSLLS:DeprecatedMethodCall-on
		Ответ.РезультатJSON = РезультатОшибкиВJSON(Ответ.Ошибка);
		Ответ.Сводка = Ответ.Ошибка;
		ЗаписьЖурналаРегистрации("Начальное заполнение", УровеньЖурналаРегистрации.Ошибка, , , Подробно);
		Возврат Ответ;
	КонецПопытки;

	СозданоПользователей = 0;
	Для Каждого Пользователь Из Результат.Пользователи Цикл
		Если Пользователь.Создан Тогда
			СозданоПользователей = СозданоПользователей + 1;
		КонецЕсли;
	КонецЦикла;

	Ответ.Успех = Истина;
	Ответ.РезультатJSON = РезультатВJSON(Результат);
	Ответ.Сводка = "организация " + ?(Результат.ОрганизацияСоздана, "создана", "уже была")
		+ ";пользователей создано " + Формат(СозданоПользователей, ФорматЧисла())
		+ " из " + Формат(Результат.Пользователи.Количество(), ФорматЧисла())
		+ ";служебный администратор " + ?(Результат.СлужебныйАдминистраторСоздан, "создан", "не создавался")
		+ ";предупреждений " + Формат(Результат.Предупреждения.Количество(), ФорматЧисла());

	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазборJSON

// Разбирает payload и собирает структуру параметров. Лишние поля игнорируются,
// отсутствие обязательных - исключение с перечнем.
//
// Параметры:
//  ТекстJSON - Строка - payload
//
// Возвращаемое значение:
//  Структура - см. ПараметрыЗаполнения()
//
Функция ПараметрыИзJSON(ТекстJSON)

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Попытка
		Данные = ПрочитатьJSON(Чтение, Истина);
	Исключение
		Информация = ИнформацияОбОшибке();
		// BSLLS:DeprecatedMethodCall-off
		ВызватьИсключение "payload не является корректным JSON: " + КраткоеПредставлениеОшибки(Информация);
		// BSLLS:DeprecatedMethodCall-on
	КонецПопытки;
	Чтение.Закрыть();

	Если Не ЭтоОбъектJSON(Данные) Тогда
		ВызватьИсключение "payload должен быть JSON-объектом";
	КонецЕсли;

	Отсутствуют = Новый Массив;
	Параметры = ПараметрыЗаполнения();

	КомпаниюИзJSON(ЗначениеПоля(Данные, "company", Неопределено), Параметры, Отсутствуют);

	// owner (ФИО, e-mail, телефон владельца) принимается, но не используется: у организации
	// и пользователя в конфигурации нет реквизитов для контактов (docs/TECHDEBT.md).

	СписокПользователей = ЗначениеПоля(Данные, "users", Новый Массив);
	Если ТипЗнч(СписокПользователей) <> Тип("Массив") Тогда
		ВызватьИсключение "users должен быть массивом";
	КонецЕсли;
	Для Номер = 0 По СписокПользователей.ВГраница() Цикл
		Путь = "users[" + Формат(Номер, "ЧГ=0") + "]";
		Описание = СписокПользователей[Номер];
		Если Не ЭтоОбъектJSON(Описание) Тогда
			ВызватьИсключение Путь + " должен быть объектом";
		КонецЕсли;
		Параметры.Пользователи.Добавить(ПользовательИзJSON(Описание, Путь, Отсутствуют));
	КонецЦикла;

	АдминистратораИзJSON(ЗначениеПоля(Данные, "support_admin", Неопределено), Параметры, Отсутствуют);

	Если Отсутствуют.Количество() > 0 Тогда
		ВызватьИсключение "в payload нет обязательных полей: " + СтрСоединить(Отсутствуют, ", ");
	КонецЕсли;

	Возврат Параметры;

КонецФункции

// Заполняет организацию и умолчания базы из объекта company.
//
// Параметры:
//  Компания    - Соответствие, Неопределено - объект company
//  Параметры   - Структура        - см. ПараметрыЗаполнения(), заполняется
//  Отсутствуют - Массив из Строка - пополняемый список обязательных полей, которых нет
//
Процедура КомпаниюИзJSON(Компания, Параметры, Отсутствуют)

	Если Не ЭтоОбъектJSON(Компания) Тогда
		Отсутствуют.Добавить("company");
		Возврат;
	КонецЕсли;

	Параметры.Организация.Наименование = СокрЛП(ЗначениеПоля(Компания, "name", ""));
	Если ПустаяСтрока(Параметры.Организация.Наименование) Тогда
		Отсутствуют.Добавить("company.name");
	КонецЕсли;
	Параметры.Организация.ВидКонтрагента = ВидКонтрагентаПоКоду(ЗначениеПоля(Компания, "kind", ""));
	Параметры.Организация.Префикс = СокрЛП(ЗначениеПоля(Компания, "prefix", ""));
	Параметры.Валюта = СокрЛП(ЗначениеПоля(Компания, "currency", ""));
	Параметры.Страна = СокрЛП(ЗначениеПоля(Компания, "country", ""));
	Параметры.Язык = СокрЛП(ЗначениеПоля(Компания, "language", ""));
	Параметры.Отрасль = ОтрасльПоКоду(ЗначениеПоля(Компания, "industry", ""));

КонецПроцедуры

// Отрасль по коду из payload: имя перечисления либо английский код хаба
// (trade, construction, other). Пустое или неизвестное значение - торговля.
//
// Параметры:
//  Код - Строка
//
// Возвращаемое значение:
//  ПеречислениеСсылка.Отрасли
//
Функция ОтрасльПоКоду(Код)

	Значение = НРег(СокрЛП(Код));
	Если Значение = "строительство" Или Значение = "construction" Или Значение = "real_estate" Тогда
		Отрасль = Перечисления.Отрасли.Строительство;
	ИначеЕсли Значение = "прочее" Или Значение = "other" Тогда
		Отрасль = Перечисления.Отрасли.Прочее;
	Иначе
		Отрасль = Перечисления.Отрасли.Торговля;
	КонецЕсли;
	Возврат Отрасль;

КонецФункции

// Описания дополнительных реквизитов номенклатуры для отрасли «Строительство».
//
// Возвращаемое значение:
//  Массив из Структура - Имя, Порядок, ТипЗначения, Заголовки (Соответствие код языка -> заголовок)
//
Функция ОтраслевыеРеквизитыСтроительства()

	// BSLLS:MagicNumber-off - порядок полей и длины строк заданы прямо в описании реквизитов.
	Реквизиты = Новый Массив;
	Описание = ОписаниеОтраслевогоРеквизита("ОбъектНедвижимости", 10, Новый ОписаниеТипов("Булево"),
		"Объект недвижимости", "Bien immobilier", "Real estate object", "Inmueble");
	Реквизиты.Добавить(Описание);
	Описание = ОписаниеОтраслевогоРеквизита("Этаж", 20, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)),
		"Этаж", "Étage", "Floor", "Piso");
	Реквизиты.Добавить(Описание);
	// Типы - в пределах типа значения плана видов характеристик (Число 15,3; Строка 200):
	// иначе платформа не даст записать вид характеристики.
	Описание = ОписаниеОтраслевогоРеквизита("Площадь", 30, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 2)),
		"Площадь (кв. м)", "Surface (m²)", "Surface (m²)", "Superficie (m²)");
	Реквизиты.Добавить(Описание);
	Описание = ОписаниеОтраслевогоРеквизита("НомерПраваСобственности", 40,
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)),
		"Номер права собственности", "Titre foncier", "Land title", "Título de propiedad");
	Реквизиты.Добавить(Описание);
	// BSLLS:MagicNumber-on
	Возврат Реквизиты;

КонецФункции

// Описание одного отраслевого реквизита.
//
// Параметры:
//  Имя         - Строка - имя реквизита для программного доступа
//  Порядок     - Число - порядок поля в форме
//  ТипЗначения - ОписаниеТипов
//  Ru          - Строка - заголовок по-русски
//  Fr          - Строка - заголовок по-французски
//  En          - Строка - заголовок по-английски
//  Es          - Строка - заголовок по-испански
//
// Возвращаемое значение:
//  Структура - Имя, Порядок, ТипЗначения, Заголовки
//
Функция ОписаниеОтраслевогоРеквизита(Имя, Порядок, ТипЗначения, Ru, Fr, En, Es)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("ru", Ru);
	Заголовки.Вставить("fr", Fr);
	Заголовки.Вставить("en", En);
	Заголовки.Вставить("es", Es);
	Описание = Новый Структура;
	Описание.Вставить("Имя", Имя);
	Описание.Вставить("Порядок", Порядок);
	Описание.Вставить("ТипЗначения", ТипЗначения);
	Описание.Вставить("Заголовки", Заголовки);
	Возврат Описание;

КонецФункции

// Заводит один отраслевой дополнительный реквизит номенклатуры, если его ещё нет.
//
// Параметры:
//  Отрасль  - ПеречислениеСсылка.Отрасли
//  Описание - Структура - см. ОписаниеОтраслевогоРеквизита
//
// Возвращаемое значение:
//  Число - 1, если реквизит создан; 0, если уже был
//
Функция ДобавитьОтраслевойРеквизит(Отрасль, Описание)

	ИмяОбъекта = "Справочник.Номенклатура";
	Если ЗначениеЗаполнено(УправлениеСвойствами.НайтиСвойство(ИмяОбъекта, Описание.Имя)) Тогда
		Возврат 0;
	КонецЕсли;

	Параметры = УправлениеСвойствами.ПараметрыДобавленияСвойства();
	Параметры.ИмяОбъекта = ИмяОбъекта;
	Параметры.Имя = Описание.Имя;
	Параметры.Наименование = Описание.Заголовки.Получить("ru");
	Параметры.ТипЗначения = Описание.ТипЗначения;
	Параметры.Порядок = Описание.Порядок;
	Параметры.Отрасль = Отрасль;
	Параметры.Заголовки = Описание.Заголовки;
	УправлениеСвойствами.ДобавитьСвойство(Параметры);
	Возврат 1;

КонецФункции

// Заполняет описание служебного администратора из объекта support_admin.
//
// Параметры:
//  Администратор - Соответствие, Неопределено - объект support_admin; Неопределено - не создавать
//  Параметры     - Структура        - см. ПараметрыЗаполнения(), заполняется
//  Отсутствуют   - Массив из Строка - пополняемый список обязательных полей, которых нет
//
Процедура АдминистратораИзJSON(Администратор, Параметры, Отсутствуют)

	Если Администратор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЭтоОбъектJSON(Администратор) Тогда
		ВызватьИсключение "support_admin должен быть объектом";
	КонецЕсли;

	Логин = СокрЛП(ЗначениеПоля(Администратор, "login", ИмяСлужебногоАдминистратора()));
	Пароль = ЗначениеПоля(Администратор, "password", "");
	Если ПустаяСтрока(Пароль) Тогда
		Отсутствуют.Добавить("support_admin.password");
	КонецЕсли;
	Параметры.СлужебныйАдминистратор = Новый Структура("Логин, Пароль", Логин, Пароль);

КонецПроцедуры

Функция ЭтоОбъектJSON(Значение)

	Возврат ТипЗнч(Значение) = Тип("Соответствие");

КонецФункции

// Формат целых чисел в сводке и result: без разделителей групп и без пустой строки вместо нуля.
//
// Возвращаемое значение:
//  Строка - форматная строка
//
Функция ФорматЧисла()

	Возврат "ЧГ=0; ЧН=0";

КонецФункции

// Описание пользователя из объекта JSON.
//
// Параметры:
//  Описание    - Соответствие      - объект users[i]
//  Путь        - Строка            - путь поля для сообщения об ошибке
//  Отсутствуют - Массив из Строка  - пополняемый список обязательных полей, которых нет
//
// Возвращаемое значение:
//  Структура - см. ОписаниеПользователя()
//
Функция ПользовательИзJSON(Описание, Путь, Отсутствуют)

	Пользователь = ОписаниеПользователя();
	Пользователь.Логин = СокрЛП(ЗначениеПоля(Описание, "login", ""));
	Пользователь.Пароль = ЗначениеПоля(Описание, "password", "");
	Пользователь.ПолноеИмя = СокрЛП(ЗначениеПоля(Описание, "full_name", ""));
	Пользователь.Язык = СокрЛП(ЗначениеПоля(Описание, "language", ""));

	Если ПустаяСтрока(Пользователь.Логин) Тогда
		Отсутствуют.Добавить(Путь + ".login");
	КонецЕсли;
	Если ПустаяСтрока(Пользователь.Пароль) Тогда
		Отсутствуют.Добавить(Путь + ".password");
	КонецЕсли;

	Роли = ЗначениеПоля(Описание, "roles", Новый Массив);
	Если ТипЗнч(Роли) = Тип("Строка") Тогда
		Пользователь.Роли.Добавить(Роли);
	ИначеЕсли ТипЗнч(Роли) = Тип("Массив") Тогда
		Для Каждого Роль Из Роли Цикл
			Пользователь.Роли.Добавить(Строка(Роль));
		КонецЦикла;
	Иначе
		ВызватьИсключение Путь + ".roles должен быть массивом строк";
	КонецЕсли;

	Возврат Пользователь;

КонецФункции

// Значение поля JSON-объекта либо умолчание, если поля нет или оно null.
//
// Параметры:
//  Объект    - Соответствие - объект JSON
//  Ключ      - Строка       - имя поля
//  Умолчание - Произвольный - что вернуть при отсутствии
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеПоля(Объект, Ключ, Умолчание)

	Значение = Объект.Получить(Ключ);
	Если Значение = Неопределено Тогда
		Возврат Умолчание;
	КонецЕсли;
	Возврат Значение;

КонецФункции

// Вид контрагента по коду из payload: имя перечисления либо английский код хаба.
// Неизвестное значение - юридическое лицо.
//
// Параметры:
//  Код - Строка
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыКонтрагентов
//
Функция ВидКонтрагентаПоКоду(Код)

	Значение = НРег(СокрЛП(Код));
	Если Значение = "индивидуальныйпредприниматель" Или Значение = "sole_proprietor" Или Значение = "entrepreneur" Тогда
		Вид = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	ИначеЕсли Значение = "обособленноеподразделение" Или Значение = "branch" Тогда
		Вид = Перечисления.ВидыКонтрагентов.ОбособленноеПодразделение;
	ИначеЕсли Значение = "частноелицо" Или Значение = "individual" Или Значение = "private" Тогда
		Вид = Перечисления.ВидыКонтрагентов.ЧастноеЛицо;
	Иначе
		Вид = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	КонецЕсли;
	Возврат Вид;

КонецФункции

// Результат заполнения в JSON для result-файла. Паролей в результате нет по построению.
//
// Параметры:
//  Результат - Структура - см. ЗаполнитьБазу()
//
// Возвращаемое значение:
//  Строка - JSON
//
Функция РезультатВJSON(Результат)

	СписокПользователей = Новый Массив;
	Для Каждого Пользователь Из Результат.Пользователи Цикл
		СписокПользователей.Добавить(Новый Структура("login, created", Пользователь.Логин, Пользователь.Создан));
	КонецЦикла;

	Данные = Новый Структура;
	Данные.Вставить("success", Истина);
	Данные.Вставить("organization_created", Результат.ОрганизацияСоздана);
	Данные.Вставить("organization", Строка(Результат.Организация));
	Данные.Вставить("users", СписокПользователей);
	Данные.Вставить("support_admin_created", Результат.СлужебныйАдминистраторСоздан);
	Данные.Вставить("industry_attributes_created", Результат.СозданоРеквизитовОтрасли);
	Данные.Вставить("organizations_total", Результат.ВсегоОрганизаций);
	Данные.Вставить("users_total", Результат.ВсегоПользователей);
	Данные.Вставить("warnings", Результат.Предупреждения);

	Возврат СериализоватьВJSON(Данные);

КонецФункции

Функция РезультатОшибкиВJSON(Ошибка)

	Данные = Новый Структура("success, error", Ложь, Ошибка);
	Возврат СериализоватьВJSON(Данные);

КонецФункции

Функция СериализоватьВJSON(Данные)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  "));
	ЗаписатьJSON(Запись, Данные);
	Возврат Запись.Закрыть();

КонецФункции

#КонецОбласти

#Область Проверки

Процедура ПроверитьПараметры(Параметры)

	Ошибки = Новый Массив;

	Если ПустаяСтрока(Параметры.Организация.Наименование) Тогда
		Ошибки.Добавить("не задано наименование организации");
	КонецЕсли;

	Логины = Новый Соответствие;
	Для Каждого Пользователь Из Параметры.Пользователи Цикл
		Логин = СокрЛП(Пользователь.Логин);
		Если ПустаяСтрока(Логин) Тогда
			Ошибки.Добавить("у пользователя не задан логин");
		ИначеЕсли Логины.Получить(НРег(Логин)) <> Неопределено Тогда
			Ошибки.Добавить("логин повторяется: " + Логин);
		Иначе
			Логины.Вставить(НРег(Логин), Истина);
		КонецЕсли;
		Если ПустаяСтрока(Пользователь.Пароль) Тогда
			Ошибки.Добавить("у пользователя " + Логин + " не задан пароль");
		КонецЕсли;
	КонецЦикла;

	Если Параметры.СлужебныйАдминистратор <> Неопределено Тогда
		Если ПустаяСтрока(Параметры.СлужебныйАдминистратор.Пароль) Тогда
			Ошибки.Добавить("у служебного администратора не задан пароль");
		КонецЕсли;
		Логин = СокрЛП(Параметры.СлужебныйАдминистратор.Логин);
		Если Не ПустаяСтрока(Логин) И Логины.Получить(НРег(Логин)) <> Неопределено Тогда
			Ошибки.Добавить("логин служебного администратора совпадает с логином пользователя: " + Логин);
		КонецЕсли;
	КонецЕсли;

	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Ошибки, "; ");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Организация

Функция НайтиОрганизацию(Наименование)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Наименование = &Наименование
		|	И НЕ Организации.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции

Функция СоздатьОрганизацию(Описание)

	Организация = Справочники.Организации.СоздатьЭлемент();
	Организация.Наименование = СокрЛП(Описание.Наименование);
	Организация.ВидКонтрагента = Описание.ВидКонтрагента;
	Организация.Префикс = СокрЛП(Описание.Префикс);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(Организация, "Логотип", Описание.Логотип);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(Организация, "ФонПечатныхФорм", Описание.ФонПечатныхФорм);
	Организация.Записать();
	Возврат Организация.Ссылка;

КонецФункции

Функция КоличествоОрганизаций()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Организации.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.Организации КАК Организации");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество;

КонецФункции

// Константы валюты регламентированного учёта и страны календаря: ставятся только
// пустые, значения из payload, которых в базе нет, дают предупреждение, а не ошибку.
//
// Параметры:
//  Параметры      - Структура        - см. ПараметрыЗаполнения(): поля Валюта и Страна
//  Предупреждения - Массив из Строка - пополняется, если значение не подошло
//
Процедура УстановитьВалютуИСтрану(Параметры, Предупреждения)

	Если Не ПустаяСтрока(Параметры.Валюта) И Не ЗначениеЗаполнено(Константы.ВалютаРегламентированногоУчета.Получить()) Тогда
		Валюта = ВалютаПоКодуИлиНаименованию(Параметры.Валюта);
		Если ЗначениеЗаполнено(Валюта) Тогда
			Константы.ВалютаРегламентированногоУчета.Установить(Валюта);
		Иначе
			Предупреждения.Добавить("валюта не найдена в справочнике, константа не установлена: " + Параметры.Валюта);
		КонецЕсли;
	КонецЕсли;

	Если Не ПустаяСтрока(Параметры.Страна) И ПустаяСтрока(Константы.СтранаКалендаря.Получить()) Тогда
		ДлинаКодаАльфа2 = 2;
		Код = ВРег(СокрЛП(Параметры.Страна));
		Если СтрДлина(Код) = ДлинаКодаАльфа2 Тогда
			Константы.СтранаКалендаря.Установить(Код);
		Иначе
			Предупреждения.Добавить("страна календаря ожидается кодом альфа-2, константа не установлена: " + Параметры.Страна);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Валюта по коду (MAD), наименованию либо предопределённому элементу для кодов ISO,
// у которых в справочнике код может быть заполнен иначе.
//
// Параметры:
//  Значение - Строка - код или наименование
//
// Возвращаемое значение:
//  СправочникСсылка.Валюты - пустая ссылка, если не найдена
//
Функция ВалютаПоКодуИлиНаименованию(Значение)

	Псевдонимы = Новый Соответствие;
	Псевдонимы.Вставить("MAD", "MoroccanDirham");
	Псевдонимы.Вставить("EUR", "Евро");
	Псевдонимы.Вставить("USD", "ДолларСША");
	Псевдонимы.Вставить("RUB", "РоссийскийРубль");

	Валюта = НайтиВалюту("Код", СокрЛП(Значение));
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = НайтиВалюту("Наименование", СокрЛП(Значение));
	КонецЕсли;
	Предопределенное = Псевдонимы.Получить(ВРег(СокрЛП(Значение)));
	Если Не ЗначениеЗаполнено(Валюта) И Предопределенное <> Неопределено Тогда
		Валюта = НайтиВалюту("ИмяПредопределенныхДанных", Предопределенное);
	КонецЕсли;
	Возврат Валюта;

КонецФункции

Функция НайтиВалюту(ИмяПоля, Значение)

	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	НЕ Валюты.ПометкаУдаления
		|	И Валюты.&ИмяПоля = &Значение";
	Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, "&ИмяПоля", ИмяПоля));
	Запрос.УстановитьПараметр("Значение", Значение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Валюты.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область Пользователи

// Заводит пользователя ИБ с элементом справочника Пользователи и физлицом.
// Существующий пользователь ИБ не меняется - идемпотентность повторного запуска.
//
// Параметры:
//  Описание       - Структура - см. ОписаниеПользователя()
//  Организация    - СправочникСсылка.Организации
//  Язык           - ОбъектМетаданных, Неопределено - язык интерфейса; Неопределено - основной
//  ВСпискеВыбора  - Булево - показывать в списке выбора при входе (служебный администратор - нет)
//  Предупреждения - Массив из Строка - пополняется при неизвестных ролях
//
// Возвращаемое значение:
//  Булево - Истина, если пользователь создан; Ложь - уже был
//
Функция ЗаписатьПользователя(Описание, Организация, Язык, ВСпискеВыбора, Предупреждения)

	Логин = СокрЛП(Описание.Логин);
	Если ПользователиИнформационнойБазы.НайтиПоИмени(Логин) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ПолноеИмя = ?(ПустаяСтрока(Описание.ПолноеИмя), Логин, СокрЛП(Описание.ПолноеИмя));

	ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	ПользовательИБ.Имя = Логин;
	ПользовательИБ.ПолноеИмя = ПолноеИмя;
	ПользовательИБ.Пароль = Описание.Пароль;
	ПользовательИБ.АутентификацияСтандартная = Истина;
	ПользовательИБ.ЗапрещеноВосстанавливатьПароль = Истина;
	ПользовательИБ.ЗапрещеноИзменятьПароль = Истина;
	ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Истина;
	ПользовательИБ.ПоказыватьВСпискеВыбора = ВСпискеВыбора;
	ПользовательИБ.Язык = ?(Язык = Неопределено, Метаданные.ОсновнойЯзык, Язык);

	ПользовательИБ.Роли.Очистить();
	Для Каждого ИмяРоли Из РолиПользователя(Описание, Предупреждения) Цикл
		ПользовательИБ.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
	КонецЦикла;
	ПользовательИБ.Записать();

	Элемент = ЭлементПользователяПоНаименованию(Логин);
	Если Элемент = Неопределено Тогда
		Элемент = Справочники.Пользователи.СоздатьЭлемент();
	КонецЕсли;
	Элемент.Наименование = Логин;
	Элемент.ПолноеИмя = ПолноеИмя;
	Элемент.Внешний = Истина;
	Элемент.ВходВПрограммуРазрешен = Истина;
	Элемент.Организация = Организация;
	Элемент.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	Элемент.Роли = Справочники.Пользователи.СформироватьСписокРолей(ПользовательИБ);
	Если Не ЗначениеЗаполнено(Элемент.ФизическоеЛицо) Тогда
		// Физлицо обязательно для пользователя (продавец в продажах и зарплате).
		Элемент.ФизическоеЛицо = СоздатьФизическоеЛицо(ПолноеИмя);
	КонецЕсли;
	Элемент.Записать();

	Возврат Истина;

КонецФункции

// Имена существующих ролей для пользователя: неизвестные пропускаются с предупреждением,
// роль Клиент (личный кабинет контрагента) сотрудникам не выдаётся, пустой список -
// Администратор.
//
// Параметры:
//  Описание       - Структура - см. ОписаниеПользователя()
//  Предупреждения - Массив из Строка
//
// Возвращаемое значение:
//  Массив из Строка - имена ролей
//
Функция РолиПользователя(Описание, Предупреждения)

	Роли = Новый Массив;
	Для Каждого ИмяРоли Из Описание.Роли Цикл
		Имя = СокрЛП(ИмяРоли);
		Роль = Метаданные.Роли.Найти(Имя);
		Если Роль = Неопределено Тогда
			Предупреждения.Добавить("роль не найдена, пропущена у " + СокрЛП(Описание.Логин) + ": " + Имя);
			Продолжить;
		КонецЕсли;
		Если Роль = Метаданные.Роли.Клиент Тогда
			Продолжить;
		КонецЕсли;
		Если Роли.Найти(Роль.Имя) = Неопределено Тогда
			Роли.Добавить(Роль.Имя);
		КонецЕсли;
	КонецЦикла;

	Если Роли.Количество() = 0 Тогда
		Если Описание.Роли.Количество() > 0 Тогда
			Предупреждения.Добавить("ни одна роль не подошла, выдан Администратор: " + СокрЛП(Описание.Логин));
		КонецЕсли;
		Роли.Добавить("Администратор");
	КонецЕсли;

	Возврат Роли;

КонецФункции

Функция ЭлементПользователяПоНаименованию(Наименование)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &Наименование
		|	И НЕ Пользователи.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция СоздатьФизическоеЛицо(Наименование)

	ФизическоеЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
	ФизическоеЛицо.Наименование = Наименование;
	ФизическоеЛицо.Записать();
	Возврат ФизическоеЛицо.Ссылка;

КонецФункции

// Язык конфигурации по имени (Русский) или коду (ru). Пустое значение - Неопределено
// без предупреждения; неизвестное - Неопределено с предупреждением.
//
// Параметры:
//  Значение       - Строка
//  Предупреждения - Массив из Строка
//  Логин          - Строка - чей язык, для текста предупреждения; пустая строка - умолчание базы
//
// Возвращаемое значение:
//  ОбъектМетаданных, Неопределено
//
Функция ЯзыкПоИмениИлиКоду(Значение, Предупреждения, Логин)

	Искомое = НРег(СокрЛП(Значение));
	Если ПустаяСтрока(Искомое) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Для Каждого Язык Из Метаданные.Языки Цикл
		Если НРег(Язык.Имя) = Искомое Или НРег(Язык.КодЯзыка) = Искомое Тогда
			Возврат Язык;
		КонецЕсли;
	КонецЦикла;

	Текст = "язык не найден, взят основной" + ?(ПустаяСтрока(Логин), "", " у " + Логин) + ": " + СокрЛП(Значение);
	Предупреждения.Добавить(Текст);
	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецОбласти
